data/Parm_PH_29/alpha_075/alpha_075/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
        (0   1.0    -.1  )//0
        (8.0355   1.0    -.1  )//1
        (8.0355   2.0    -.1  )//2
        (0   2.0    -.1  )//3
        (0   1.0     .1  )//4
        (8.0355   1.0     .1  )//5
        (8.0355   2.0     .1  )//6
        (0   2.0     .1  )//7
        (8.0355   3.036  -.1  )//8
        (0   3.036  -.1  )//9
        (0   3.036   .1  )//10
        (8.0355   3.036   .1  )//11
);

blocks
(
        //hex (0 1 3 2 6 7 9 8) (40 25 30) simpleGrading (1 10.7028 1)
        hex (0 1 2 3 4 5 6 7)   (120 65 1) simpleGrading (1 10 1)
        hex (3 2 8 9 7 6 11 10) (120 65 1) simpleGrading (1 .1 1)
);

/*
edges
(
      spline 0 1 ((0.25 -0.1 0.1))
      spline 3 2 ((0.75  0.1 0.1))
);
*/

//EDGES-START
edges
(
spline 0 1 (
(0 1 -0.1)
(0.0075 1 -0.1)
(0.015 1 -0.1)
(0.0225 1 -0.1)
(0.03 1 -0.1)
(0.0375 1 -0.1)
(0.045 1 -0.1)
(0.0525 1 -0.1)
(0.06 1 -0.1)
(0.0675 1 -0.1)
(0.075 1 -0.1)
(0.0825 1 -0.1)
(0.09 0.999853500361723 -0.1)
(0.0975 0.999546574964562 -0.1)
(0.105 0.999147670842287 -0.1)
(0.1125 0.998646794216239 -0.1)
(0.12 0.998033951307763 -0.1)
(0.1275 0.997299148338199 -0.1)
(0.135 0.996432391528892 -0.1)
(0.1425 0.995423687101183 -0.1)
(0.15 0.994263041276416 -0.1)
(0.1575 0.992940460275932 -0.1)
(0.165 0.991445950321075 -0.1)
(0.1725 0.989769517633187 -0.1)
(0.18 0.987901168433611 -0.1)
(0.1875 0.985830908943689 -0.1)
(0.195 0.983548745384765 -0.1)
(0.2025 0.98104468397818 -0.1)
(0.21 0.978308730945277 -0.1)
(0.2175 0.9753308925074 -0.1)
(0.225 0.97210117488589 -0.1)
(0.2325 0.968609584302091 -0.1)
(0.24 0.964846126977344 -0.1)
(0.2475 0.960802791061489 -0.1)
(0.255 0.956483795770945 -0.1)
(0.2625 0.951898021524438 -0.1)
(0.27 0.947054357916131 -0.1)
(0.2775 0.941961694540189 -0.1)
(0.285 0.936628920990776 -0.1)
(0.2925 0.931064926862056 -0.1)
(0.3 0.925278601748195 -0.1)
(0.3075 0.919278835243357 -0.1)
(0.315 0.913074516941706 -0.1)
(0.3225 0.906674536437407 -0.1)
(0.33 0.900087783324624 -0.1)
(0.3375 0.893323147197522 -0.1)
(0.345 0.886389517650265 -0.1)
(0.3525 0.879295784277018 -0.1)
(0.36 0.872050836671945 -0.1)
(0.3675 0.864663564429211 -0.1)
(0.375 0.857142857142802 -0.1)
(0.3825 0.849497397992501 -0.1)
(0.39 0.841735044498589 -0.1)
(0.3975 0.833863447766786 -0.1)
(0.405 0.825890258902813 -0.1)
(0.4125 0.81782312901239 -0.1)
(0.42 0.809669709201238 -0.1)
(0.4275 0.801437650575077 -0.1)
(0.435 0.793134604239629 -0.1)
(0.4425 0.784768221300614 -0.1)
(0.45 0.776346152863751 -0.1)
(0.4575 0.767876050034763 -0.1)
(0.465 0.75936556391937 -0.1)
(0.4725 0.750822345623292 -0.1)
(0.48 0.742254046252249 -0.1)
(0.4875 0.733668316911963 -0.1)
(0.495 0.725072808708154 -0.1)
(0.5025 0.716475172746543 -0.1)
(0.51 0.70788306013285 -0.1)
(0.5175 0.699304121972797 -0.1)
(0.525 0.690746009372103 -0.1)
(0.5325 0.682216373436488 -0.1)
(0.54 0.673722597050246 -0.1)
(0.5475 0.665267557822977 -0.1)
(0.555 0.656850395032062 -0.1)
(0.5625 0.648470134799476 -0.1)
(0.57 0.640125803247193 -0.1)
(0.5775 0.631816426497189 -0.1)
(0.585 0.623541030671437 -0.1)
(0.5925 0.615298641891911 -0.1)
(0.6 0.607088286280585 -0.1)
(0.6075 0.598908989959435 -0.1)
(0.615 0.590759779050434 -0.1)
(0.6225 0.582639679675556 -0.1)
(0.63 0.574547717956777 -0.1)
(0.6375 0.56648292001607 -0.1)
(0.645 0.558444311975409 -0.1)
(0.6525 0.550430919956769 -0.1)
(0.66 0.542441770082123 -0.1)
(0.6675 0.534475888473448 -0.1)
(0.675 0.526532301252716 -0.1)
(0.6825 0.518610034541902 -0.1)
(0.69 0.51070811446298 -0.1)
(0.6975 0.502825567137925 -0.1)
(0.705 0.494961418688711 -0.1)
(0.7125 0.487114695237311 -0.1)
(0.72 0.479284422905702 -0.1)
(0.7275 0.471469627815856 -0.1)
(0.735 0.463669336089748 -0.1)
(0.7425 0.455882573849353 -0.1)
...
)
spline 4 5 (
(0 1 0.1)
(0.0075 1 0.1)
(0.015 1 0.1)
(0.0225 1 0.1)
(0.03 1 0.1)
(0.0375 1 0.1)
(0.045 1 0.1)
(0.0525 1 0.1)
(0.06 1 0.1)
(0.0675 1 0.1)
(0.075 1 0.1)
(0.0825 1 0.1)
(0.09 0.999853500361723 0.1)
(0.0975 0.999546574964562 0.1)
(0.105 0.999147670842287 0.1)
(0.1125 0.998646794216239 0.1)
(0.12 0.998033951307763 0.1)
(0.1275 0.997299148338199 0.1)
(0.135 0.996432391528892 0.1)
(0.1425 0.995423687101183 0.1)
(0.15 0.994263041276416 0.1)
(0.1575 0.992940460275932 0.1)
(0.165 0.991445950321075 0.1)
(0.1725 0.989769517633187 0.1)
(0.18 0.987901168433611 0.1)
(0.1875 0.985830908943689 0.1)
(0.195 0.983548745384765 0.1)
(0.2025 0.98104468397818 0.1)
(0.21 0.978308730945277 0.1)
(0.2175 0.9753308925074 0.1)
(0.225 0.97210117488589 0.1)
(0.2325 0.968609584302091 0.1)
(0.24 0.964846126977344 0.1)
(0.2475 0.960802791061489 0.1)
(0.255 0.956483795770945 0.1)
(0.2625 0.951898021524438 0.1)
(0.27 0.947054357916131 0.1)
(0.2775 0.941961694540189 0.1)
(0.285 0.936628920990776 0.1)
(0.2925 0.931064926862056 0.1)
(0.3 0.925278601748195 0.1)
(0.3075 0.919278835243357 0.1)
(0.315 0.913074516941706 0.1)
(0.3225 0.906674536437407 0.1)
(0.33 0.900087783324624 0.1)
(0.3375 0.893323147197522 0.1)
(0.345 0.886389517650265 0.1)
(0.3525 0.879295784277018 0.1)
(0.36 0.872050836671945 0.1)
(0.3675 0.864663564429211 0.1)
(0.375 0.857142857142802 0.1)
(0.3825 0.849497397992501 0.1)
(0.39 0.841735044498589 0.1)
(0.3975 0.833863447766786 0.1)
(0.405 0.825890258902813 0.1)
(0.4125 0.81782312901239 0.1)
(0.42 0.809669709201238 0.1)
(0.4275 0.801437650575077 0.1)
(0.435 0.793134604239629 0.1)
(0.4425 0.784768221300614 0.1)
(0.45 0.776346152863751 0.1)
(0.4575 0.767876050034763 0.1)
(0.465 0.75936556391937 0.1)
(0.4725 0.750822345623292 0.1)
(0.48 0.742254046252249 0.1)
(0.4875 0.733668316911963 0.1)
(0.495 0.725072808708154 0.1)
(0.5025 0.716475172746543 0.1)
(0.51 0.70788306013285 0.1)
(0.5175 0.699304121972797 0.1)
(0.525 0.690746009372103 0.1)
(0.5325 0.682216373436488 0.1)
(0.54 0.673722597050246 0.1)
(0.5475 0.665267557822977 0.1)
(0.555 0.656850395032062 0.1)
(0.5625 0.648470134799476 0.1)
(0.57 0.640125803247193 0.1)
(0.5775 0.631816426497189 0.1)
(0.585 0.623541030671437 0.1)
(0.5925 0.615298641891911 0.1)
(0.6 0.607088286280585 0.1)
(0.6075 0.598908989959435 0.1)
(0.615 0.590759779050434 0.1)
(0.6225 0.582639679675556 0.1)
(0.63 0.574547717956777 0.1)
(0.6375 0.56648292001607 0.1)
(0.645 0.558444311975409 0.1)
(0.6525 0.550430919956769 0.1)
(0.66 0.542441770082123 0.1)
(0.6675 0.534475888473448 0.1)
(0.675 0.526532301252716 0.1)
(0.6825 0.518610034541902 0.1)
(0.69 0.51070811446298 0.1)
(0.6975 0.502825567137925 0.1)
(0.705 0.494961418688711 0.1)
(0.7125 0.487114695237311 0.1)
(0.72 0.479284422905702 0.1)
(0.7275 0.471469627815856 0.1)
(0.735 0.463669336089748 0.1)
(0.7425 0.455882573849353 0.1)
...
);
//EDGES-END
//EDGES-END
//EDGES-END


boundary
(
    bottomWall
    {
        type            wall;
        faces           ((4 0 1 5));
    }
    topWall
    {
        type            wall;
        faces           ((10 11 8 9));
    }

    inlet_half0
    {
        type            cyclic;
        neighbourPatch  outlet_half0;
        faces           ((7 3 0 4));
    }

    inlet_half1
    {
        type            cyclic;
        neighbourPatch  outlet_half1;
        faces           ((7 10 9 3));
    }

    outlet_half0
    {
        type            cyclic;
        neighbourPatch  inlet_half0;
        faces           ((6 5 1 2));
    }

    outlet_half1
    {
        type            cyclic;
        neighbourPatch  inlet_half1;
        faces           ((11 6 2 8));
    }

    sideRight_half0
    {
        type            empty;
        neighbourPatch  sideLeft_half0;
        faces           ((6 7 4 5));
    }

    sideRight_half1
    {
        type            empty;
        neighbourPatch  sideLeft_half1;
        faces           ((10 7 6 11));
    }

    sideLeft_half0
    {
        type            empty;
        neighbourPatch  sideRight_half0;
        faces           ((0 3 2 1));
    }

    sideLeft_half1
    {
        type            empty;
        neighbourPatch  sideRight_half1;
        faces           ((3 9 8 2));
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
