data/Parm_PH_29/alpha_075/alpha_075/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
15600
(
(0.0366379686320119 1.0019554547921 0)
(0.109813421411876 0.99938472242561 -9.61716561969537e-20)
(0.181664403209759 0.987180338581583 9.55980588579237e-20)
(0.248891902185414 0.959621912097566 5.66385977537432e-18)
(0.309200007162546 0.918546533442375 -7.47249893191442e-18)
(0.363752196789992 0.869757169374534 -1.07150939460535e-17)
(0.414781368238178 0.817251556350638 -1.59612291892479e-18)
(0.463899710097573 0.762948864537229 7.25114704292602e-18)
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.0366441535469096 1 0)
(0.109803053906096 0.997426247000905 0)
(0.181585843297486 0.985224901962761 0)
(0.248726768164298 0.957691852780662 0)
(0.308974961025456 0.916623122761328 0)
(0.363490812176074 0.867789499359556 0)
(0.41449191959521 0.815202824661836 0)
(0.463584991881342 0.760795567804619 0)
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.03348125 3.036 0)
(0.10044375 3.036 0)
(0.16740625 3.036 0)
(0.23436875 3.036 0)
(0.30133125 3.036 0)
(0.36829375 3.036 0)
(0.43525625 3.036 0)
(0.50221875 3.036 0)
...
)
;
    }
    inlet_half0
    {
        type            cyclic;
    }
    inlet_half1
    {
        type            cyclic;
    }
    outlet_half0
    {
        type            cyclic;
    }
    outlet_half1
    {
        type            cyclic;
    }
    sideRight_half0
    {
        type            empty;
    }
    sideRight_half1
    {
        type            empty;
    }
    sideLeft_half0
    {
        type            empty;
    }
    sideLeft_half1
    {
        type            empty;
    }
}


// ************************************************************************* //
