data/Parm_PH_29/alpha_075/alpha_075/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
15600
(
1.0019554547921
0.99938472242561
0.987180338581583
0.959621912097566
0.918546533442375
0.869757169374534
0.817251556350638
0.762948864537229
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
1
0.997426247000905
0.985224901962761
0.957691852780662
0.916623122761328
0.867789499359556
0.815202824661836
0.760795567804619
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
3.036
3.036
3.036
3.036
3.036
3.036
3.036
3.036
...
)
;
    }
    inlet_half0
    {
        type            cyclic;
    }
    inlet_half1
    {
        type            cyclic;
    }
    outlet_half0
    {
        type            cyclic;
    }
    outlet_half1
    {
        type            cyclic;
    }
    sideRight_half0
    {
        type            empty;
    }
    sideRight_half1
    {
        type            empty;
    }
    sideLeft_half0
    {
        type            empty;
    }
    sideLeft_half1
    {
        type            empty;
    }
}


// ************************************************************************* //
