data/Parm_PH_29/alpha_075/alpha_075/0/k_LES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k_LES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar>
15600
(
0.00446887
0.00338344
0.00052456
0.00176937
0.00085573
0.00064571
0.00066129
0.00028625
...
)
;

boundaryField
{
    bottomWall
    {
        type        fixedValue;
        value       uniform 0;
    }
    topWall
    {
        type        fixedValue;
        value       uniform 0;
    }
    inlet_half0
    {
        type        cyclic;
    }
    inlet_half1
    {
        type        cyclic;
    }
    outlet_half0
    {
        type        cyclic;
    }
    outlet_half1
    {
        type        cyclic;
    }
    sideRight_half0
    {
        type        empty;
    }
    sideRight_half1
    {
        type        empty;
    }
    sideLeft_half0
    {
        type        empty;
    }
    sideLeft_half1
    {
        type        empty;
    }
}

// ************************************************************************* //
