data/Parm_PH_29/alpha_075/alpha_075/0/tauij_LES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      tauij_LES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor>
15600
(
(0.00513321 -0.00005541 0.00000000 0.00000994 0.00000000 0.00379458)
(0.00430057 -0.00001515 0.00000000 -0.00004657 0.00000000 0.00251289)
(0.00076281 -0.00001600 0.00000000 -0.00004325 0.00000000 0.00032956)
(0.00060665 -0.00055937 0.00000000 0.00036755 0.00000000 0.00256455)
(0.00059524 -0.00046404 0.00000000 0.00033514 0.00000000 0.00078107)
(0.00039390 -0.00028511 0.00000000 0.00017849 0.00000000 0.00071903)
(0.00030096 -0.00019134 0.00000000 0.00006770 0.00000000 0.00095392)
(0.00016148 -0.00007192 0.00000000 -0.00001019 0.00000000 0.00042120)
...
)
;

boundaryField
{
    bottomWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    topWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    inlet_half0
    {
        type        cyclic;
    }
    inlet_half1
    {
        type        cyclic;
    }
    outlet_half0
    {
        type        cyclic;
    }
    outlet_half1
    {
        type        cyclic;
    }
    sideRight_half0
    {
        type        empty;
    }
    sideRight_half1
    {
        type        empty;
    }
    sideLeft_half0
    {
        type        empty;
    }
    sideLeft_half1
    {
        type        empty;
    }
}

// ************************************************************************* //
